Статистика работы механизмов/Конфигурация/DataProcessors/_ОповещениеОНаличииСделокСАкциямиЭмитентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ОповещениеОНаличииСделокСАкциямиЭмитентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ОповещениеОНаличииСделокСАкциямиЭмитентов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.Эмитенты = Эмитенты;
	
	ОбработкаОбъект.ЗаполнитьОтчет(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	БлижайшийТорговыйДень	= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"), НачалоДня(ТекущаяДатаСеанса() - 86400));
	
	Объект.Период		= БлижайшийТорговыйДень;
	Объект.Организация	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_МКБ"));
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_Сафмар"));
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_ОВКФинанс"));
	Эмитенты.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Эмитент_МВидео"));
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
